ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/cyb06447bzi_d54.h
#define USBFS0_BASE                             0x403F0000UL
#define USBFS0                                  ((USBFS_Type*) USBFS0_BASE)                                       /* 0x403F0000 */
#define USBFS0_USBDEV                           ((USBFS_USBDEV_Type*) &USBFS0->USBDEV)                            /* 0x403F0000 */
#define USBFS0_USBLPM                           ((USBFS_USBLPM_Type*) &USBFS0->USBLPM)                            /* 0x403F2000 */
#define USBFS0_USBHOST                          ((USBFS_USBHOST_Type*) &USBFS0->USBHOST)                          /* 0x403F4000 */

/*******************************************************************************
*                                     SMIF
*******************************************************************************/

#define SMIF0_BASE                              0x40420000UL
#define SMIF0                                   ((SMIF_Type*) SMIF0_BASE)                                         /* 0x40420000 */
#define SMIF0_DEVICE0                           ((SMIF_DEVICE_Type*) &SMIF0->DEVICE[0])                           /* 0x40420800 */
#define SMIF0_DEVICE1                           ((SMIF_DEVICE_Type*) &SMIF0->DEVICE[1])                           /* 0x40420880 */
#define SMIF0_DEVICE2                           ((SMIF_DEVICE_Type*) &SMIF0->DEVICE[2])                           /* 0x40420900 */
#define SMIF0_DEVICE3                           ((SMIF_DEVICE_Type*) &SMIF0->DEVICE[3])                           /* 0x40420980 */

/*******************************************************************************
*                                     SCB
*******************************************************************************/

#define SCB0_BASE                               0x40610000UL
#define SCB1_BASE                               0x40620000UL
#define SCB2_BASE                               0x40630000UL
#define SCB3_BASE                               0x40640000UL
#define SCB4_BASE                               0x40650000UL
#define SCB5_BASE                               0x40660000UL
#define SCB6_BASE                               0x40670000UL
#define SCB7_BASE                               0x40680000UL
#define SCB8_BASE                               0x40690000UL
#define SCB0                                    ((CySCB_Type*) SCB0_BASE)                                         /* 0x40610000 */
#define SCB1                                    ((CySCB_Type*) SCB1_BASE)                                         /* 0x40620000 */
#define SCB2                                    ((CySCB_Type*) SCB2_BASE)                                         /* 0x40630000 */
#define SCB3                                    ((CySCB_Type*) SCB3_BASE)                                         /* 0x40640000 */
#define SCB4                                    ((CySCB_Type*) SCB4_BASE)                                         /* 0x40650000 */
#define SCB5                                    ((CySCB_Type*) SCB5_BASE)                                         /* 0x40660000 */
#define SCB6                                    ((CySCB_Type*) SCB6_BASE)                                         /* 0x40670000 */
#define SCB7                                    ((CySCB_Type*) SCB7_BASE)                                         /* 0x40680000 */
#define SCB8                                    ((CySCB_Type*) SCB8_BASE)                                         /* 0x40690000 */

/*******************************************************************************
*                                     CTBM
*******************************************************************************/

#define CTBM0_BASE                              0x41100000UL
#define CTBM0                                   ((CTBM_Type*) CTBM0_BASE)                                         /* 0x41100000 */

/*******************************************************************************
*                                    CTDAC
*******************************************************************************/

#define CTDAC0_BASE                             0x41140000UL
#define CTDAC0                                  ((CTDAC_Type*) CTDAC0_BASE)                                       /* 0x41140000 */

/*******************************************************************************
*                                     SAR
*******************************************************************************/

#define SAR_BASE                                0x411D0000UL
#define SAR                                     ((SAR_Type*) SAR_BASE)                                            /* 0x411D0000 */

/*******************************************************************************
*                                     PASS
*******************************************************************************/

#define PASS_BASE                               0x411F0000UL
#define PASS                                    ((PASS_Type*) PASS_BASE)                                          /* 0x411F0000 */
#define PASS_AREF                               ((PASS_AREF_Type*) &PASS->AREF)                                   /* 0x411F0E00 */

/*******************************************************************************
*                                     I2S
*******************************************************************************/

#define I2S0_BASE                               0x42A10000UL
#define I2S0                                    ((I2S_Type*) I2S0_BASE)                                           /* 0x42A10000 */

/*******************************************************************************
*                                     PDM
*******************************************************************************/

#define PDM0_BASE                               0x42A20000UL
#define PDM0                                    ((PDM_Type*) PDM0_BASE)                                           /* 0x42A20000 */


/* Backward compatibility definitions */
#define CY_SRAM0_BASE                           CY_SRAM_BASE
#define CY_SRAM0_SIZE                           CY_SRAM_SIZE
#define I2S                                     I2S0
#define PDM                                     PDM0

/** \} CYB06447BZI-D54 */

#endif /* _CYB06447BZI_D54_H_ */


/* [] END OF FILE */
